// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
// Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();      // "2.2.2.1"
	
	ПараметрыЭтойОбработки = ПолучитьПараметрыЭтойОбработки(Ложь);
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Информация = ПараметрыЭтойОбработки.Комментарий
	//+ ?(ЗначениеЗаполнено(ПараметрыЭтойОбработки.Комментарий), Символы.ПС, "")
	//+ "Дата создания: 01.01.2020." + Символы.ПС
	//+ "Дата последнего редактирования: 01.02.2020.";
	//ПараметрыРегистрации.Версия = "1.0.0.1";
	ПараметрыРегистрации.БезопасныйРежим = ЛОЖЬ; // отключаем безопасный режим только при необходимости
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = ПараметрыЭтойОбработки.Синоним;
	НоваяКоманда.Идентификатор = ПараметрыЭтойОбработки.Имя;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	//НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	//НоваяКоманда.Представление = ПараметрыЭтойОбработки.Синоним;
	//НоваяКоманда.Идентификатор = ПараметрыЭтойОбработки.Имя;
	//НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьПараметрыЭтойОбработки(ВызыватьИсключение = Истина) Экспорт
	
	ИмяОбработки = ЭтотОбъект.Метаданные().Имя;
	СинонимОбработки = ЭтотОбъект.Метаданные().Синоним;
	КомментарийОбработки = ЭтотОбъект.Метаданные().Комментарий;
	
	Ссылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
	Если Ссылка.Пустая() Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение "Данная обработка не зарегистрирована в справочнике внешних обработок!";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЭтойОбработки = Новый Структура;
	ПараметрыЭтойОбработки.Вставить("Ссылка", Ссылка);
	ПараметрыЭтойОбработки.Вставить("Имя", ИмяОбработки);
	ПараметрыЭтойОбработки.Вставить("Синоним", ?(ЗначениеЗаполнено(СинонимОбработки), СинонимОбработки, ИмяОбработки));
	ПараметрыЭтойОбработки.Вставить("Комментарий", КомментарийОбработки);
	
	Возврат ПараметрыЭтойОбработки;
	
КонецФункции
